app/Http/Controllers/Web/CallCentre/OrderController.php

        public function addDeal(Request $request, $id)
        {
            $order = new Order();
            $group_deal = GroupDeal::find($id);
            session(['group_deal' => $group_deal]);
            session(['order' => $order]);
            $selected_items = session('selected_items');
            session()->put('selected_items', json_decode($request->selected_items));
            $group_deal->load('groupDealItems.groupDealSingleItems.menuItem');
            $restaurant = session('restaurant');

            // render add view with the group deal items
            return Inertia::render('CallCentreAdmin/Orders/AddDeal', [
                'groupDeal' => $group_deal,
                'restaurant' => $restaurant,
                'selected_items' => json_decode($request->selected_items),
            ]);
---
SELECT * FROM `group_deals` WHERE `group_deals`.`id` = '1' LIMIT 1
SELECT * FROM `group_deals` WHERE `group_deals`.`id` = '2' LIMIT 1
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (1)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (1, 2)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (1, 2, 3, 4)
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (2)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (5, 6)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (5, 6)

        public function chooseSizes(Request $request, $id)
        {

            $group_deal_single_item = GroupDealSingleItem::where('menu_item_id', $id)->first();

            $group_deal_single_item->load('menuItem');
---
SELECT * FROM `group_deal_single_items` WHERE `menu_item_id` = '1' LIMIT 1
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (1)

        public function placeOrder(Request $request) {

            $reference = Str::random();

            if(Order::where('order_reference', $reference)->exists()) {
                $reference = Str::random();
            }

            $restaurant = Restaurant::where('id', session()->get('restaurant')->id)->first();
---
SELECT exists(SELECT * FROM `orders` WHERE `order_reference` = 'Mro8BbY9TAGDiNSi') as `exists`
SELECT * FROM `restaurants` WHERE `id` = 1 LIMIT 1

                    }

                    $order->payment_intent_id = $session->payment_intent;
                    $order->save();
---
UPDATE `orders` SET `payment_intent_id` = , `orders`.`updated_at` = '2022-11-25 07:19:39' WHERE `id` = 11

        public function updateItems(Request $request)
        {
            $group_deal = session('group_deal')->load('groupDealItems.groupDealSingleItems.menuItem');
---
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (2)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (2)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (3, 4)

        session(['selected_items' => $selected_items]);


        return Inertia::render('CallCentreAdmin/Orders/AddDeal', [
            'groupDeal' => $group_deal->load('groupDealItems.groupDealSingleItems.menuItem'),
            'restaurant' => $restaurant,
            'selected_items' => $selected_items,
            "message" => "Successfully added size and extras to item " . $menu_item->name,
        ]);
---
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (3)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (7, 8)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (5, 6)

        session()->forget('group_deal_single_item');
        session()->forget('selected_items');

        $restaurant = Restaurant::with('menuCategories', 'menuItems', 'openingHours')->where('contact_number', $request->contact_number)->first();
---
SELECT * FROM `menu_categories` WHERE `menu_categories`.`restaurant_id` in (1)
SELECT * FROM `restaurants` WHERE `contact_number` = '+447368360039' LIMIT 1

            ]);
        }
        // get opening hours
        $openingHours = OpeningHour::where('restaurant_id', $restaurant->id)->get();
---
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1

            $currentDay = date('l');

            // get day
            $day = Day::where('day_of_the_week', $currentDay)->first();

            // get opening hours for the day
            $todaysHours = OpeningHour::where('day_id', $day->id)->where('restaurant_id', $restaurant->id)->get();
---
SELECT * FROM `days` WHERE `day_of_the_week` = 'Friday' LIMIT 1
SELECT * FROM `opening_hours` WHERE `day_id` = 5 and `restaurant_id` = 1




            $group_deals = GroupDeal::where('restaurant_id', $restaurant->id)->get();
            $menu_categories = MenuCategory::where('restaurant_id', $restaurant->id)->get();
            foreach ($menu_categories as $menu_category) {
                $menu_category->menu_items = MenuItem::where('menu_category_id', $menu_category->id)->with('extras', 'sizes')->get();
---
SELECT * FROM `group_deals` WHERE `restaurant_id` = 5
SELECT * FROM `menu_categories` WHERE `restaurant_id` = 5
SELECT * FROM `menu_items` WHERE `menu_category_id` = 7
SELECT `extras`.*, `extra_menu_item`.`menu_item_id` as `pivot_menu_item_id`, `extra_menu_item`.`extra_id` as `pivot_extra_id` FROM `extras` inner join `extra_menu_item` on `extras`.`id` = `extra_menu_item`.`extra_id` WHERE `extra_menu_item`.`menu_item_id` in (5)
SELECT `sizes`.*, `menu_item_size`.`menu_item_id` as `pivot_menu_item_id`, `menu_item_size`.`size_id` as `pivot_size_id` FROM `sizes` inner join `menu_item_size` on `sizes`.`id` = `menu_item_size`.`size_id` WHERE `menu_item_size`.`menu_item_id` in (5)