app/Http/Controllers/Web/CallCentre/OrderController.php

        public function saveSizesAndExtras(Request $request)
        {
            $group_deal = session('group_deal');
            $restaurant = session('restaurant');
            $group_deal_single_item = session('group_deal_single_item');
            $menu_item = MenuItem::find($group_deal_single_item->menu_item_id);
---
SELECT * FROM `menu_items` WHERE `id` = 4 LIMIT 1

        public function index(Request $request)
        {
            if($request->session()->has('order')){
                $order = $request->session()->get('order');
                $restaurant = $request->session()->get('restaurant');
                $order->load('items');
---
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (1, 5, 6, 8, 10, 15, 19)