app/Http/Controllers/Web/CallCentre/OrderController.php

        public function chooseSizes(Request $request, $id)
        {

            $group_deal_single_item = GroupDealSingleItem::where('menu_item_id', $id)->first();

            $group_deal_single_item->load('menuItem');

            session(['group_deal_single_item' => $group_deal_single_item]);

            $restaurant = session('restaurant');

            $group_deal = session('group_deal');

            $group_deal->load("groupDealItems.groupDealSingleItems.menuItem.extras");
            $group_deal->load("groupDealItems.groupDealSingleItems.menuItem.sizes");

            $menu_items = $group_deal_single_item->menuItem;
            $menu_items->load('extras');
            $menu_items->load('sizes');
---
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (1, 2, 3, 4)

        public function updateItems(Request $request)
        {
            $group_deal = session('group_deal')->load('groupDealItems.groupDealSingleItems.menuItem');
            $restaurant = session('restaurant');
            $group_deal_single_item = session('group_deal_single_item');
            $menu_item = MenuItem::where('id', $group_deal_single_item->menu_item_id)->first();
            $new_selected_size = array();
            $new_selected_extra = array();
            $notes = "";
            $quantity = 1;
            $menu_item->setAttribute('notes', $notes);
            $menu_item->setAttribute('quantity', $quantity);
            $menu_item_sizes = $menu_item->sizes()->get();
            $menu_item_extras = $menu_item->extras()->get();
---
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (1)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (1, 2)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (1, 2, 3, 4)
SELECT `sizes`.*, `menu_item_size`.`menu_item_id` as `pivot_menu_item_id`, `menu_item_size`.`size_id` as `pivot_size_id` FROM `sizes` inner join `menu_item_size` on `sizes`.`id` = `menu_item_size`.`size_id` WHERE `menu_item_size`.`menu_item_id` = 6
SELECT `extras`.*, `extra_menu_item`.`menu_item_id` as `pivot_menu_item_id`, `extra_menu_item`.`extra_id` as `pivot_extra_id` FROM `extras` inner join `extra_menu_item` on `extras`.`id` = `extra_menu_item`.`extra_id` WHERE `extra_menu_item`.`menu_item_id` = 6

        session()->forget('group_deal_single_item');
        session()->forget('selected_items');

        $restaurant = Restaurant::with('menuCategories', 'menuItems', 'openingHours')->where('contact_number', $request->contact_number)->first();
---
SELECT * FROM `menu_categories` WHERE `menu_categories`.`restaurant_id` in (5)
SELECT * FROM `restaurants` WHERE `contact_number` = '+447368360039' LIMIT 1

            ]);
        }
        // get opening hours
        $openingHours = OpeningHour::where('restaurant_id', $restaurant->id)->get();
---
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 5

            $currentDay = date('l');

            // get day
            $day = Day::where('day_of_the_week', $currentDay)->first();

            // get opening hours for the day
            $todaysHours = OpeningHour::where('day_id', $day->id)->where('restaurant_id', $restaurant->id)->get();
---
SELECT * FROM `days` WHERE `day_of_the_week` = 'Monday' LIMIT 1
SELECT * FROM `opening_hours` WHERE `day_id` = 1 and `restaurant_id` = 5