app/Http/Controllers/Web/Restaurant/ConfigurationController.php

    public function edit(){
        $restaurant = Restaurant::where('id', Auth::user()->restaurant_id)->first();
        $banner = Banner::where('restaurant_id', Auth::user()->restaurant_id)->first();
        $logo = Logo::where('restaurant_id', Auth::user()->restaurant_id)->first();

         $categories = RestaurantCategory::orderBy('name')->get();
         $user = User::where('restaurant_id', Auth::user()->restaurant_id)->first();
---
SELECT * FROM `restaurants` WHERE `id` = 2 LIMIT 1
SELECT * FROM `banner` WHERE `restaurant_id` = 2 LIMIT 1
SELECT * FROM `logo` WHERE `restaurant_id` = 2 LIMIT 1
SELECT * FROM `users` WHERE `restaurant_id` = 2 LIMIT 1
SELECT * FROM `restaurant_categories` ORDER BY `name` ASC