app/Http/Controllers/Web/Restaurant/ExtraController.php

SELECT * FROM `extras` WHERE `restaurant_id` = 2 and (`name` like '%%' or `description` like '%%') ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `extras` WHERE `restaurant_id` = 2 and (`name` like '%%' or `description` like '%%')
---
    public function index(Request $request)
    {
            // Apply a search to the model
            $search = $request->get('search', '');
            $perPage = $request->get('perPage', 10);
            $from = $request->get('from', '');
            $to = $request->get('to', '');


            // get the Extras
            $extras = Extra::where('restaurant_id', Auth::user()->restaurant_id)
            ->where(function ($query) use ($search) {
                $query->where('name', 'like', '%' . $search . '%')
                    ->orWhere('description', 'like', '%' . $search . '%');
            })->latest()->paginate($perPage ?? 10);

INSERT INTO `extras` (`name`, `description`, `additional_charge`, `restaurant_id`, `updated_at`, `created_at`) VALUES ('jalapenos', 'jalepenos', '1.4', 1, '2022-11-16 00:03:26', '2022-11-16 00:03:26')
---
    public function store(Request $request)
    {
        // Validate the data
        $request->validate([
            'name' => ['required', 'string', 'max:191'],
            'description' => ['nullable', 'string', 'max:191'],
            'additional_charge' => ['nullable', 'numeric'],
        ]);

        // Create a new extra
        $extra = Extra::create([
            'name' => $request->name,
            'description' => $request->description,
            'additional_charge' => $request->additional_charge ?? 0,
            'restaurant_id' => Auth::user()->restaurant_id,
        ]);

SELECT * FROM `menu_items` WHERE `restaurant_id` = 2
---
    public function destroy(Extra $extra)
    {
        // delete the extra with the specified id from the menu item that has it
        $menu_items = MenuItem::where('restaurant_id', Auth::user()->restaurant_id)->get();