app/Http/Controllers/Web/Restaurant/GroupDealController.php

    public function index(Request $request)
    {
        // get a list of Group Deals
        $group_deals = GroupDeal::where('restaurant_id', Auth::user()->restaurant_id)->get();

        // Apply a search to the model
        $search = $request->get('search', '');
        $perPage = $request->get('perPage', '');
        $groupDeals = GroupDeal::where('restaurant_id', Auth::user()->restaurant_id)
        ->where(function ($query) use ($search) {
            $query->where('title', 'like', '%' . $search . '%')
                ->orWhere('description', 'like', '%' . $search . '%');
        })->latest()->paginate($perPage ?? 10);
---
SELECT * FROM `group_deals` WHERE `restaurant_id` = 1
SELECT * FROM `group_deals` WHERE `restaurant_id` = 1 and (`title` like '%%' or `description` like '%%') ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `group_deals` WHERE `restaurant_id` = 1 and (`title` like '%%' or `description` like '%%')

    public function create(Request $request)
    {
        // create a new Group Deal
        $groupDeal = new GroupDeal;
        $existingMenuItems = MenuItem::where('restaurant_id', Auth::user()->restaurant_id)->get();
---
SELECT * FROM `menu_items` WHERE `restaurant_id` = 1

    public function edit(Request $request, GroupDeal $groupDeal)
    {
        // Load the Group Deal and its related items
        $groupDeal->load('groupDealItems.groupDealSingleItems.menuItem');

        // get a list of Menu Items
        $existingMenuItems = MenuItem::where('restaurant_id', Auth::user()->restaurant_id)->get();
---
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` in (10)
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` in (1, 2)
SELECT * FROM `menu_items` WHERE `menu_items`.`id` in (2, 11, 14)
SELECT * FROM `menu_items` WHERE `restaurant_id` = 1

    public function update(Request $request, GroupDeal $groupDeal)
    {
        // validate the request
        $this->validate($request, [
            'title' => 'required|string|max:255',
            'description' => 'required|string|max:255',
            'group_deal_price' => 'required|numeric',
            "group_deal_items" => "required|array",
            "group_deal_single_items" => "required|array",
        ]);

        // update the Group Deal
        $groupDeal->update([
            'title' => $request->title,
            'description' => $request->description,
            'group_deal_price' => $request->group_deal_price,
        ]);

        foreach($groupDeal->groupDealItems as $groupDealItem) {

            $groupDealItem->deleteGroupDealSingleItems();

            $groupDealItem->delete();
        }

        foreach ($request->group_deal_items as $key => $groupDealItem) {

            $groupDealItem = $groupDeal->groupDealItems()->create([
                "title" => $groupDealItem['title'],
            ]);

            foreach ($request->group_deal_single_items[$key] as $item) {
                $groupDealSingleItem = $groupDealItem->groupDealSingleItems()->create([
                    "menu_item_id" => $item['id'],
                    "group_deal_id" => $groupDeal->id,
                ]);
---
SELECT * FROM `group_deal_items` WHERE `group_deal_items`.`group_deal_id` = 10 and `group_deal_items`.`group_deal_id` IS not NULL
DELETE FROM `group_deal_items` WHERE `id` = 3
INSERT INTO `group_deal_items` (`title`, `group_deal_id`, `updated_at`, `created_at`) VALUES ('wewewewewe', 10, '2022-10-12 22:10:44', '2022-10-12 22:10:44')
INSERT INTO `group_deal_single_items` (`menu_item_id`, `group_deal_id`, `group_deal_item_id`, `updated_at`, `created_at`) VALUES (14, 10, 5, '2022-10-12 22:10:44', '2022-10-12 22:10:44')