app/Http/Controllers/Web/Restaurant/MenuItemController.php

    public function index(Request $request)
    {
        // Create a model for this
        $item = new MenuItem;
        $search = $request->get('search', '');
        $filter = $request->get('filter', '');
        $perPage = $request->get('perPage', 10);


        // get menu categories for this restaurant
        $menuCategories = MenuCategory::where('restaurant_id', Auth::user()->restaurant_id)->get();


        $items = $item
            ->where('restaurant_id', Auth::user()->restaurant_id)
            ->with('category')
            ->where(function ($q) use ($search) {
                $q->where('title', 'LIKE', '%' . $search . '%');
            })
            ->when($filter, function ($q) use ($filter) {
                $q->where('menu_category_id', $filter);
            })
            ->latest()
            ->paginate($perPage ?? 10);
---
SELECT * FROM `menu_categories` WHERE `restaurant_id` = 1
SELECT * FROM `menu_categories` WHERE `menu_categories`.`id` in (1, 2, 3, 4)

    public function create(Request $request)
    {
        $menuItem = new MenuItem;
        $categories = MenuCategory::where('restaurant_id', Auth::user()->restaurant_id)->orderBy('title')->get();
        $extras = Extra::where('restaurant_id', Auth::user()->restaurant_id)->get();
---
SELECT * FROM `menu_categories` WHERE `restaurant_id` = 1 ORDER BY `title` ASC
SELECT * FROM `extras` WHERE `restaurant_id` = 1

    public function store(Request $request)
    {
        // dd($request->all());


        // validate
        $request->validate([
            'title' => 'required',
            'description' => 'required',
            'price' => 'required',
            'extras' => 'nullable|array',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg|max:2048',
            'menu_category_id' => 'required|integer',
            'sizes' => 'nullable|array',
            'additional_charge' => 'nullable|numeric',
        ]);
        $menuItem = new MenuItem;
        // create new menu item
        $menuItem->title = $request->title;
        $menuItem->description = $request->description;
        $menuItem->price = $request->price;
        $menuItem->menu_category_id = $request->menu_category_id;
        $menuItem->dietary_requirements = $request->dietary_requirements;
        $menuItem->restaurant_id = Auth::user()->restaurant_id;
        $menuItem->image = ImagePackage::save($request->image, 'menu_items');
        $menuItem->save();
        $sizes = $request->get('sizes', []);

        foreach ($sizes as $size) {
            $newSize = Size::create([
                'name' => $size['size'],
                'additional_charge' => $size['additional_charge'],
                'restaurant_id' => Auth::user()->restaurant_id,
            ]);

            $menuItem->sizes()->attach($newSize);
---
INSERT INTO `menu_items` (`title`, `description`, `price`, `menu_category_id`, `dietary_requirements`, `restaurant_id`, `image`, `updated_at`, `created_at`) VALUES ('burger', 'yum bro', '22.3', '2', 'none actually', 1, '/images/menu_items/2022-11-0716678328634K-Food-HD-Wallpaper.jpg', '2022-11-07 14:54:23', '2022-11-07 14:54:23')
INSERT INTO `sizes` (`name`, `additional_charge`, `restaurant_id`, `updated_at`, `created_at`) VALUES ('medium', '2', 1, '2022-11-07 14:54:23', '2022-11-07 14:54:23')
INSERT INTO `menu_item_size` (`menu_item_id`, `size_id`) VALUES (5, 6)

        $extras = $request->get('extras', []);

        foreach ($extras as $extra) {
            $existingExtra = Extra::find($extra['id']);

            $menuItem->extras()->attach($existingExtra);
---
SELECT * FROM `extras` WHERE `extras`.`id` = '3' LIMIT 1
INSERT INTO `extra_menu_item` (`extra_id`, `menu_item_id`) VALUES (3, 5)

    public function edit(MenuItem $menuItem)
    {
        // get menu categories for this restaurant
        $categories = MenuCategory::where('restaurant_id', Auth::user()->restaurant_id)->orderBy('title')->with('menuItems')->get();

        // get extras for this menu item
        $extras = $menuItem->extras()->get();
        $existingExtras = Extra::where('restaurant_id', Auth::user()->restaurant_id)->get();

        // get sizes for this menu item
        $existingSizes = $menuItem->sizes()->get();
---
SELECT * FROM `menu_categories` WHERE `restaurant_id` = 1 ORDER BY `title` ASC
SELECT `extras`.*, `extra_menu_item`.`menu_item_id` as `pivot_menu_item_id`, `extra_menu_item`.`extra_id` as `pivot_extra_id` FROM `extras` inner join `extra_menu_item` on `extras`.`id` = `extra_menu_item`.`extra_id` WHERE `extra_menu_item`.`menu_item_id` = 5
SELECT * FROM `extras` WHERE `restaurant_id` = 1
SELECT `sizes`.*, `menu_item_size`.`menu_item_id` as `pivot_menu_item_id`, `menu_item_size`.`size_id` as `pivot_size_id` FROM `sizes` inner join `menu_item_size` on `sizes`.`id` = `menu_item_size`.`size_id` WHERE `menu_item_size`.`menu_item_id` = 5

    public function update(Request $request, MenuItem $menuItem)
    {
        // validate
        $request->validate([
            'title' => 'required',
            'description' => 'required',
            'price' => 'required',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg|max:2048',
            'menu_category_id' => 'required|integer',
            'sizes' => 'nullable|array',
            'additional_charge' => 'nullable|numeric',
        ]);


        // update menu item
        $menuItem->title = is_null($request->title) ? $menuItem->title : $request->title;
        $menuItem->description = is_null($request->description) ? $menuItem->description : $request->description;
        $menuItem->price = is_null($request->price) ? $menuItem->price : $request->price;
        $menuItem->dietary_requirements = is_null($request->dietary_requirements) ? $menuItem->dietary_requirements : $request->dietary_requirements;
        $menuItem->image = is_null($request->image) ? $menuItem->image : ImagePackage::save($request->image, 'menu_items');
        $menuItem->save();

        // detach all extras
        $menuItem->extras()->detach();

        // attach new extras
        $extras = $request->get('extras', []);

        foreach ($extras as $extra) {
            $existingExtra = Extra::find($extra['id']);

            $menuItem->extras()->attach($existingExtra);
---
DELETE FROM `extra_menu_item` WHERE `extra_menu_item`.`menu_item_id` = 5
SELECT * FROM `extras` WHERE `extras`.`id` = '3' LIMIT 1
INSERT INTO `extra_menu_item` (`extra_id`, `menu_item_id`) VALUES (3, 5)



        // detach all sizes
        $menuItem->sizes()->detach();
---
DELETE FROM `menu_item_size` WHERE `menu_item_size`.`menu_item_id` = 5

        $sizes = $request->get('sizes', []);

        foreach ($sizes as $size) {
            $newSize = Size::create([
                'name' => $size['name'],
                'additional_charge' => $size['additional_charge'],
                'restaurant_id' => Auth::user()->restaurant_id,
            ]);

            $menuItem->sizes()->attach($newSize);
---
INSERT INTO `sizes` (`name`, `additional_charge`, `restaurant_id`, `updated_at`, `created_at`) VALUES ('med', '2.4', 1, '2022-11-04 15:18:02', '2022-11-04 15:18:02')
INSERT INTO `menu_item_size` (`menu_item_id`, `size_id`) VALUES (5, 11)