app/Http/Controllers/Web/Restaurant/MenuCategoryController.php

INSERT INTO `menu_categories` (`title`, `restaurant_id`, `updated_at`, `created_at`) VALUES ('dessert', 2, '2022-10-20 08:22:52', '2022-10-20 08:22:52')
---
    public function store(Request $request)
    {
        // Validate the data
        $request->validate([
            'title' => 'required|string|max:255',
        ]);

        // Create a new model
        $category = MenuCategory::create([
            'title' => $request->title,
            'restaurant_id' => Auth::user()->restaurant_id,
        ]);