app/Http/Controllers/Web/Restaurant/OpeningHourController.php

SELECT * FROM `days` WHERE `day_of_the_week` = 'Tuesday' LIMIT 1
SELECT * FROM `days` WHERE `day_of_the_week` = 'Wednesday' LIMIT 1
SELECT * FROM `days` WHERE `day_of_the_week` = 'Thursday' LIMIT 1
SELECT * FROM `days` WHERE `day_of_the_week` = 'Saturday' LIMIT 1
SELECT * FROM `days` WHERE `day_of_the_week` = 'Sunday' LIMIT 1
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` IS NULL) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 1
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 1) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 1
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 2
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 2) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 2
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 3
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 3) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 3
---
    public function edit(Request $request, $id)
    {
        $user = User::find($id);
        $restaurant_id = $user->restaurant_id;
        // get days of the week
        $monday = Day::where('day_of_the_week', 'Monday')->first();
        $tuesday = Day::where('day_of_the_week', 'Tuesday')->first();
        $wednesday = Day::where('day_of_the_week', 'Wednesday')->first();
        $thursday = Day::where('day_of_the_week', 'Thursday')->first();
        $friday = Day::where('day_of_the_week', 'Friday')->first();
        $saturday = Day::where('day_of_the_week', 'Saturday')->first();
        $sunday = Day::where('day_of_the_week', 'Sunday')->first();

        // check if opening hours exist, if they do then get them
        if (OpeningHour::where('restaurant_id', $restaurant_id)->exists()){
        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $monday->id)->exists()) {
            $opening_hours_monday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $monday->id)->get();
        } else {
            $opening_hours_monday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $tuesday->id)->exists()) {
            $opening_hours_tuesday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $tuesday->id)->get();
        } else {
            $opening_hours_tuesday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $wednesday->id)->exists()) {
            $opening_hours_wednesday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $wednesday->id)->get();

SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 5
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 4) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 4
---
            $opening_hours_wednesday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $thursday->id)->exists()) {
            $opening_hours_thursday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $thursday->id)->get();

SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 6
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 5) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 5
---
            $opening_hours_thursday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $friday->id)->exists()) {
            $opening_hours_friday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $friday->id)->get();

SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 7
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 6) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 6
---
            $opening_hours_friday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $saturday->id)->exists()) {
            $opening_hours_saturday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $saturday->id)->get();

SELECT * FROM `opening_hours` WHERE `restaurant_id` = 1 and `day_id` = 4
SELECT exists(SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 7) as `exists`
SELECT * FROM `opening_hours` WHERE `restaurant_id` = 2 and `day_id` = 7
---
            $opening_hours_saturday = "";
        }

        if(OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $sunday->id)->exists()) {
            $opening_hours_sunday = OpeningHour::where('restaurant_id', $restaurant_id)->where('day_id', $sunday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` IS NULL) as `exists`
SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 1) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 1
---
    }

    // check if collection times exist, if they do then get them
    if (CollectionTime::where('restaurant_id', $restaurant_id)->exists()){
        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $monday->id)->exists()) {
            $collection_times_monday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $monday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 2) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 2
---
            $collection_times_monday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $tuesday->id)->exists()) {
            $collection_times_tuesday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $tuesday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 3) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 3
---
            $collection_times_tuesday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $wednesday->id)->exists()) {
            $collection_times_wednesday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $wednesday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 4) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 4
---
            $collection_times_wednesday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $thursday->id)->exists()) {
            $collection_times_thursday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $thursday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 5) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 5
---
            $collection_times_thursday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $friday->id)->exists()) {
            $collection_times_friday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $friday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 6) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 6
---
            $collection_times_friday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $saturday->id)->exists()) {
            $collection_times_saturday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $saturday->id)->get();

SELECT exists(SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 7) as `exists`
SELECT * FROM `collection_times` WHERE `restaurant_id` = 2 and `day_id` = 7
---
            $collection_times_saturday = "";
        }

        if(CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $sunday->id)->exists()) {
            $collection_times_sunday = CollectionTime::where('restaurant_id', $restaurant_id)->where('day_id', $sunday->id)->get();

SELECT * FROM `restaurants` WHERE `id` = 1 LIMIT 1
---
    public function update(Request $request)
    {

        $restaurant = Restaurant::where('id', Auth::user()->restaurant_id)->first();