app/Http/Controllers/Web/Restaurant/OrderController.php

        public function index(Request $request, $id)
        {
            $user = User::find($id);
               // Get all users, paginate through them using the "perPage" parameter. Search through the users, if the "search" parameter is present.
          $search = $request->get('search', '');
          $status = $request->get('status', '');
          $from = $request->get('from', '');
          $to = $request->get('to', '');

              $orders = Order::where('restaurant_id', $user->restaurant_id)->where(function ($q) use ($search) {
                 $q->where('customer_name', 'LIKE', '%' . $search . '%')->orWhere('customer_contact_number', 'LIKE', '%' . $search . '%')->orWhere('address_line_1', 'LIKE', '%' . $search . '%')->orWhere('address_line_2', 'LIKE', '%' . $search . '%')->orWhere('town', 'LIKE', '%' . $search . '%')->orWhere('postcode', 'LIKE', '%' . $search . '%')->orWhere('status', 'LIKE', '%' . $search . '%');
              })
              ->when($from, function($q) use ($from) {
                $q->whereDate('pickup_date', '>=', $from);
            })
            ->when($to, function($q) use ($to) {
                $q->whereDate('pickup_date', '<=', $to);
            })
            ->when($status, function($q) use ($status) {
                $q->where('status', $status);
            })
              ->latest()
              ->paginate($request->perPage ?? 10);
---
SELECT * FROM `orders` WHERE `restaurant_id` = 1 and (`customer_name` LIKE '%al%' or `customer_contact_number` LIKE '%al%' or `address_line_1` LIKE '%al%' or `address_line_2` LIKE '%al%' or `town` LIKE '%al%' or `postcode` LIKE '%al%' or `status` LIKE '%al%') ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `orders` WHERE `restaurant_id` = 1 and (`customer_name` LIKE '%al%' or `customer_contact_number` LIKE '%al%' or `address_line_1` LIKE '%al%' or `address_line_2` LIKE '%al%' or `town` LIKE '%al%' or `postcode` LIKE '%al%' or `status` LIKE '%al%')

    public function show(Request $request, Order $order)
    {

        $order_items = OrderItem::where('order_id', $order->id)->get();
        $user = User::find($order->user_id);
        $customer = User::where('id', $order->customer_id)->first();
        $configuration = Configuration::first();
---
SELECT * FROM `order_items` WHERE `order_id` = 3
SELECT * FROM `users` WHERE `id` = 7 LIMIT 1
SELECT * FROM `configurations` LIMIT 1