app/Http/Controllers/Web/Restaurant/StripeController.php

    public function link(Request $request)
    {

        $stripe = new \Stripe\StripeClient(
            config('stripe.sk')
        );

        $appURL = config('app.url');

        $restaurant = Restaurant::find(Auth::user()->restaurant_id);
---
SELECT * FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1