app/Http/Controllers/Web/Restaurant/TableController.php

    public function index(Request $request)
    {
        //get all the table numbers belonging to the restaurant
        $tableNumbers = TableNumber::where('restaurant_id', Auth::user()->restaurant_id)->get();
---
SELECT * FROM `table_numbers` WHERE `restaurant_id` = 1

    public function store(Request $request)
    {
        // validate the request
        $request->validate([
            'table_number' => 'required',
        ]);

        // create the table number
        $tableNumber = TableNumber::create([
            'restaurant_id' => Auth::user()->restaurant_id,
            'table_number' => $request->table_number,
            'table_reference' => $request->table_reference,
        ]);
---
INSERT INTO `table_numbers` (`restaurant_id`, `table_number`, `table_reference`, `updated_at`, `created_at`) VALUES (1, '1', 'by window', '2022-11-16 01:09:17', '2022-11-16 01:09:17')