app/Http/Controllers/Web/AdminRestaurantsController.php

SELECT * FROM `restaurants` WHERE `application_status` = 'approved' LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `restaurants` WHERE `application_status` = 'approved'
---
    public function index(Request $request)
    {
        // Get all restaurants, paginate through them using the "perPage" parameter. Search through the restaurants, if the "search" parameter is present.
        $search = $request->search ?? null;

        if($search !== null){

            $restaurants = Restaurant::where('application_status', 'approved')
            ->where(function ($q) use ($search) {
                $q->where('name', 'LIKE', '%' . $search . '%');
            })
            ->orderBy('name', 'asc')
            ->paginate(10);
        }
        else {

            $restaurants = Restaurant::where('application_status', 'approved')->paginate($request->perPage ?? 10);
        }

        return Inertia::render('MainAdmin/AdminRestaurants/Index', [
            'restaurants' => $restaurants,
            "perPage" => $request->perPage ?? 10,
            "search" => $request->search ?? null
        ]);

SELECT * FROM `restaurant_categories` ORDER BY `name` ASC
---
    public function create(){
        $restaurant = new Restaurant;

        $categories = RestaurantCategory::orderBy('name')->get();

SELECT * FROM `roles` WHERE `name` = 'restaurant_admin' LIMIT 1
---
    public function store(Request $request){
         // Validate the data
         $request->validate([
            'name' => ['required', 'string', 'max:191'],
            'category' => ['required', 'int', 'min: 0'],
            'address_line_1' => ['required', 'string', 'max:191'],
            'town' => ['required', 'string', 'max:191'],
            'county' => ['required', 'string', 'max:191'],
            'postcode' => ['required', 'string', 'max:191'],
            'contact_number' => ['required', 'string', 'max:191'],
            'email' => ['required', 'email', 'max:191', 'unique:users,email,'],
            'password' => ['nullable', 'confirmed', 'min:6'],
            "role" => "required|exists:roles,name",
        ]);

        // Get the role based on the name
        $role = Role::where('name', $request->role)->first();

SELECT * FROM `banner` WHERE `restaurant_id` = 1 LIMIT 1
SELECT * FROM `logo` WHERE `restaurant_id` = 1 LIMIT 1
SELECT * FROM `restaurant_categories` ORDER BY `name` ASC
SELECT * FROM `users` WHERE `restaurant_id` = 1 LIMIT 1
---
    public function edit(Restaurant $restaurant){
        // Find the model for this ID
        // dd(RestaurantCategory::find(9));
        $banner = Banner::where('restaurant_id', $restaurant->id)->first();
        $logo = Logo::where('restaurant_id', $restaurant->id)->first();

         $categories = RestaurantCategory::orderBy('name')->get();
         $user = User::where('restaurant_id', $restaurant->id)->first();

SELECT * FROM `restaurants` WHERE `restaurants`.`id` = '2' LIMIT 1
SELECT * FROM `users` WHERE `restaurant_id` = '2' LIMIT 1
---
    public function update(Request $request, $id){
        $uid = $request->_userID;

        // Validate the data
         $request->validate([
            'name' => ['required', 'string', 'max:191'],
            'category' => ['required', 'int', 'min: 0'],
            'address_line_1' => ['required', 'string', 'max:191'],
            'town' => ['required', 'string', 'max:191'],
            'county' => ['required', 'string', 'max:191'],
            'postcode' => ['required', 'string', 'max:191'],
            'password' => ['nullable', 'confirmed', 'min:6'],
        ]);
        // Find the model for this ID
        $restaurant = Restaurant::find($id);

        $restaurantAddress = $request->address_line_1 . ' ' . $request->address_line_2 . ', ' . $request->town . ', ' . $request->county . ', ' . $request->postcode;

        $addressResponse = Geocoder::getCoordinatesForAddress($restaurantAddress);

        if ($addressResponse['formatted_address'] != 'result_not_found') {
           $restaurant->latitude = $addressResponse['lat'];
           $restaurant->longitude = $addressResponse['lng'];
        } // Error



        $user = User::where('restaurant_id', $id)->first();

DELETE FROM `restaurants` WHERE `id` = 1
---
    public function destroy(Restaurant $restaurant){
        $restaurant->delete();