app/Http/Controllers/Web/AdminDriverController.php

        public function index(Request $request)
        {

                // Get all restaurants, paginate through them using the "perPage" parameter. Search through the restaurants, if the "search" parameter is present.
        $search = $request->search ?? null;

        if($search !== null){
            $drivers = User::where('role_id', 4)
                 ->where(function ($q) use ($search) {
                     $q->where('first_name', 'LIKE', '%' . $search . '%')->orWhere('last_name', 'LIKE', '%' . $search . '%')->orWhere('email', 'LIKE', '%' . $search . '%');
                 })
                 ->latest()
                 ->paginate(10);
        }
        else {

            $drivers = User::where('role_id', 4)->paginate($request->perPage ?? 10);
---
SELECT * FROM `users` WHERE `role_id` = 4 LIMIT 10 offset 0
SELECT count(*) as aggregate FROM `users` WHERE `role_id` = 4