app/Http/Controllers/Web/AdminDriverTripsController.php

SELECT * FROM `orders` WHERE `user_id` = 4 ORDER BY `created_at` DESC LIMIT 10 offset 0
SELECT * FROM `restaurants` WHERE `restaurants`.`id` in (1)
SELECT count(*) as aggregate FROM `orders` WHERE `user_id` = 4
---
        public function index(Request $request, User $driver)
        {
            $from = $request->get('from', '') ?? null;
            $to = $request->get('to', '') ?? null;

            if($from !== null && $to !== null){
                $orders = Order::with('restaurant')->where('user_id', $driver->id)
                ->when($from, function($q) use ($from) {
                   $q->whereDate('pickup_date', '>=', $from);
               })
               ->when($to, function($q) use ($to) {
                   $q->whereDate('pickup_date', '<=', $to);
               })
                ->latest()
                ->paginate(10);