app/Http/Controllers/Web/AdminConfigurationsController.php

SELECT * FROM `configurations` WHERE `user_id` = 1 LIMIT 1
---
    public function edit(Request $request, User $user)
       {

            // get configuration belonging to the user
            $configuration = Configuration::where('user_id', $user->id)->first();