app/Models/GroupDealItem.php

    public function deleteGroupDealSingleItems()
    {
        foreach($this->groupDealSingleItems as $groupDealSingleItem){
            $groupDealSingleItem->delete();
---
SELECT * FROM `group_deal_single_items` WHERE `group_deal_single_items`.`group_deal_item_id` = 3 and `group_deal_single_items`.`group_deal_item_id` IS not NULL
DELETE FROM `group_deal_single_items` WHERE `id` = 7